{"":{},"Kevin":{},"oiaudou":{},"test":{"\n\nTomato Egg Skillet@Mon Dec 04 22:24:54 PST 2023":{"date":"Mon Dec 04 22:24:54 PST 2023","mealType":"Lunch","recipe":"\n\nIngredients:\n1 Tomato\n2 Eggs\n1/4 teaspoon Salt\n1/4 teaspoon Pepper\n1 tablespoon Olive Oil\n\nInstructions:\n1. Start by heating olive oil in a non-stick skillet over medium-high heat. \n2. Cut the tomato into quarter slices and add them to the skillet. \n3. Cook the tomato slices until lightly browned. \n4. Crack the eggs into a bowl, then add salt and pepper to the eggs. \n5. Add the egg mixture to the skillet and reduce the heat to medium-low. \n6. Stir the egg and tomato until the eggs are cooked and there are no raw egg pieces visible. \n7. Serve the egg and tomato dish hot. Enjoy!","title":"\n\nTomato Egg Skillet"},"\n\nCrispy You Tacos@Tue Dec 05 18:10:50 PST 2023":{"date":"Tue Dec 05 18:10:50 PST 2023","mealType":"Lunch","recipe":"\n\nIngredients:\n-1 can of chickpeas\n-1/2 cup of couscous\n-2 tablespoons olive oil\n-1 bell pepper\n-1/4 cup chopped onions\n-2 cloves garlic, minced\n-2 cups vegetable broth \n-1 teaspoon ground cumin\n-1/2 teaspoon smoked paprika\n-1/4 teaspoon red pepper flakes\n-Salt and pepper to taste\n\nDirections:\n1. Heat olive oil in a large saucepan over medium-high heat.\n2. Add the onions and bell pepper and cook for 3-4 minutes, or until the veggies start to soften.\n3. Add the minced garlic and cook for an additional minute.\n4. Add the couscous, cumin, smoked paprika, red pepper flakes, and vegetable broth. Stir everything together, bring to a boil, and reduce to a simmer.\n5. Simmer for 10-12 minutes until the couscous is cooked.\n6. Drain and rinse the chickpeas and add them to the pot. \n7. Simmer for an additional 5 minutes until everything is heated through.\n8. Remove from heat and season with salt and pepper to taste.\n9. Serve warm and enjoy!","title":"\n\nCrispy You Tacos"},"\n\nBacon and Ham Sandwich@Mon Dec 04 22:26:21 PST 2023":{"date":"Mon Dec 04 22:26:21 PST 2023","mealType":"Lunch","recipe":"\n\nIngredients needed:\n1-4 slices of Bacon \n1-2 slices of Ham \n2 slices of Bread \nOptional:\nMayonnaise\nMustard\n\nInstructions:\n1. Heat up the skillet on medium heat. \n2. Lay the bacon strips in the skillet and cook until both sides are lightly browned. \n3. After the bacon is done, set it aside and add the ham to the same skillet. \n4. Cook the ham until lightly browned, flipping it over once during the cooking process. \n5. Toast the two slices of bread in a toaster or a toaster oven.\n6. Assemble the sandwich by spreading a thin layer of mayonnaise and/or mustard (one or both depending on preference) on each slice of bread.\n7. Place the bacon and ham on one slice of bread and top it off with the other slice of bread. \n8. Enjoy your bacon and ham sandwich!","title":"\n\nBacon and Ham Sandwich"},"\n\nGrilled Steak and Rice Bowl@Tue Dec 05 21:36:13 PST 2023":{"date":"Tue Dec 05 21:36:13 PST 2023","mealType":"Dinner","recipe":"\n\nIngredients:\n\n- 2 tablespoons olive oil\n- 2 cloves garlic, minced\n- 1 pound steak, cubed\n- 2 cups long grain white rice\n- 2 tablespoons tomato paste\n- 2 tablespoons Worcestershire sauce\n- 2 cups beef broth\n- 2 cups water\n- 1 teaspoon paprika\n- Salt and pepper, to taste\n\nInstructions:\n\n1. In a large pot, heat olive oil over medium-high heat. Add garlic and cook for 1 minute, stirring constantly.\n\n2. Add cubed steak and cook until browned, about 5 minutes.\n\n3. Add the rice, tomato paste, Worcestershire sauce, beef broth, water, paprika, and salt and pepper. Stir well to combine.\n\n4. Turn the heat to high and bring the mixture to a boil.\n\n5. Once boiling, reduce the heat to low and cover. Simmer for 20-25 minutes, stirring occasionally.\n\n6. Fluff the rice with a fork before serving. Enjoy!","title":"\n\nGrilled Steak and Rice Bowl"},"\n\nHam and Egg Breakfast Skillet@Tue Dec 05 21:35:30 PST 2023":{"date":"Tue Dec 05 21:35:30 PST 2023","mealType":"Breakfast","recipe":"\n\nIngredients:\n\n-ham\n-eggs\n-dijon mustard\n-butter\n-salt \n-white pepper\n\nInstructions:\n\n1. Preheat oven to 375°F.\n\n2. Cut ham into thin slices and set aside.\n\n3. Heat a large skillet over medium heat, and add butter.\n\n4. Once the butter is melted add ham slices and sauté until lightly browned, about 5 minutes.\n\n5. In a bowl, crack eggs and beat with a whisk until mixed.\n\n6. Pour egg mixture into pan with ham and reduce heat to low.\n\n7. Stir the egg mixture constantly with a spatula until eggs begin to scramble.\n\n8. Once eggs are scrambled, season with a pinch of salt and white pepper.\n\n9. Spread the egg and ham mixture evenly in the skillet.\n\n10. Dollop ½ teaspoon of Dijon mustard onto the mixture and swish with the back of a spoon.\n\n11. Place skillet in the oven, and bake for 15 minutes.\n\n12. Serve eggs and ham warm with buttered toast. Enjoy!","title":"\n\nHam and Egg Breakfast Skillet"}},"Kevinevin123":{},"huh":{}}